# SplitToposolidFailures Properties

---
The BuiltInFailuresSplitToposolidFailures type exposes the following members.
| Name| Description
---|---|---
| GenerateNewSplitTopoFailed|  Failed to generate new toposolid after split.
| SplitToposolidFailed|  Split toposolid failed.
Top
#### Reference
BuiltInFailuresSplitToposolidFailures Class
Autodesk.Revit.DB Namespace